Delphisix/nrf52_cycling_power_sdk14/source/main.c
}

static void hal_init(void)
{
  ret_code_t err_code;
  
  err_code = nrf_drv_gpiote_init();
  APP_ERROR_CHECK(err_code);
}

static void sys_evt_dispatch(uint32_t sys_evt)
{
//  fs_sys_event_handler(sys_evt);
  ant_boot_settings_event(sys_evt);
}

static uint32_t sd_evt_handler(void)
{
  uint32_t ulEvent;
  while(sd_evt_get(&ulEvent) != NRF_ERROR_NOT_FOUND){
    ant_boot_settings_event(ulEvent);
  }
  
  return 0;
}







//==============================================================

//static void fs_evt_handler(fs_evt_t const * const evt, fs_ret_t result)
//{
//    if (result != FS_SUCCESS)
//    {
//        // An error occurred.
//    }
//}


static volatile uint8_t writeflag = 0;
volatile uint8_t fdReady = 0;

static void fds_evt_handler(fds_evt_t const * const p_fds_evt)
{
  switch(p_fds_evt->id){
  case FDS_EVT_INIT:
    if(p_fds_evt->result == FDS_SUCCESS)
      fdReady = 1;
    else
      fdReady = 0;
    break;
  case FDS_EVT_WRITE:
    writeflag = 1;
    break;
  case FDS_EVT_UPDATE:
    if(p_fds_evt->result == FDS_SUCCESS)
    {
      fdReady = 1;
    }
    break;
  default:
    break;
  }
}
/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
//static void buttons_leds_init(bool * p_erase_bonds)
//{
//    uint32_t err_code;
//    bsp_event_t startup_event;
//
//    err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS, bsp_event_handler);
//    APP_ERROR_CHECK(err_code);
//
//    err_code = bsp_btn_ble_init(NULL, &startup_event);
//    APP_ERROR_CHECK(err_code);
//
//    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
//}

/**@brief Function to execute while waiting for the wait burst busy flag
*/
static void event_burst_wait_handle(void)
{
    // No implementation needed
}

static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the Power manager.
 */
static void log_init(void)
{
    uint32_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}
static void power_management_init(void)
{
    uint32_t err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}
/** @brief Clear bonding information from persistent storage.
 */
static void delete_bonds(void)
{
    ret_code_t err_code;

    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}
/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    }
    else
    {
        uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(err_code);

        NRF_LOG_DEBUG("advertising is started");
    }
}



#define USE_SD   1
uint32_t loopCount = 0;
uint32_t hclk_run;
//static EventQueue eventQueue(16*32);
#define FPU_EXCEPTION_MASK 0x0000009F 
/**@brief Function for application main entry, does not return.
 */
int main(void)
{
  log_init();
  hal_init();
  timers_init();
  power_management_init();
  //buttons_leds_init();
  ble_stack_init();
  //peer_manage_init();
  gap_params_init();
  gatt_init();
  services_init();
  advertising_init();
  conn_params_init();
  
  bmi160_cmd_init();
  ad7124cmd_init();
  ant_bpwr_init();

  NRF_LOG_INFO("Application started\n");
  application_timers_start();
  advertising_start(false);
  ant_bpwr_start();
  
    for (;;)
    {
      if(NRF_LOG_PROCESS() == false)
        nrf_pwr_mgmt_run();
    } 
  
}


/**
 *@}
 **/
